{"review":[{"pros":"Excellent location for touring Amsterdam.","cons":"There was no soap in the shower and it was not replaced when room was serviced.,","average_score":2.79999995231628,"author":"Mary"},{"pros":"","cons":"they didn’t have toilet brushes! had to find housekeeping and borrow their brush. they didn’t have to give out either. not fun when you are two in the room, or honestly not fun when you are there alone. ","average_score":2.79999995231628,"author":"Martine"},{"pros":"The location was very central within walking distance to  most attractions with the metro and train station also close by. The hotel was very clean everywhere and the bed was super comfortable. We liked the cafe\/bar and the outdoor seating area.","cons":"Check in wasn't possible earlier than 2pm even though this was requested long in advance, after traveling from 3am it would have been nice to refresh before the day ahead. The room is comfortable but very basic, you don't have tea\/coffee facilities or even a wardrobe. The bathroom is quite small but functional.","average_score":3.20000004768372,"author":"Ciara"},{"pros":"The hotel is very well located, just 15\/20 minutes from Amsterdam Centraal, easily walkable. As well as for the attractions, most of it is just 20 min walk from the hotel. The hotel is comfortable, the only downside is the bathroom, the one in my room was faulty, the fan was not working making it a bit smelly especially after 5 nights, but that is something I believe is easy to fix.","cons":"","average_score":3.59999990463257,"author":"Diego"},{"pros":"The stuff, the area, the clean room, the facilities.","cons":"The room space was not family friendly for sure. We barely manage to open our luggages on the floor.","average_score":2.79999995231628,"author":"Johnys_d"},{"pros":"Very good breakfast, really comfortable bed! ","cons":"","average_score":3.20000004768372,"author":"Ludovica"},{"pros":"The room was according to expectations but nothing more.","cons":"The room was really small.\nThe bathroom get dirty quickly because it has no tiles or ceramic.","average_score":3.20000004768372,"author":"Mr"},{"pros":"perfect location!! in 10 min walk i was in dam square and shopping area.\r\nstaff very friendly and helpful.","cons":"no face towels in rooms, i had to asked to given to me each time","average_score":3.20000004768372,"author":"Photini"},{"pros":"","cons":"Disappointed that there were no tea\/ coffee making facilities in the rooms at the price charged","average_score":2.79999995231628,"author":"Christopher"},{"pros":"it was so clean and silent","cons":"the location was a little far from the center (16min walk)","average_score":3.59999990463257,"author":"Roza"},{"pros":"Room is looking good and it was really clean and service was great ","cons":"It was to hot in room and we try to put air condition but it didn't worked well.","average_score":3.20000004768372,"author":"Gianni"},{"pros":"Central enough to everything but not right in the hustle and bustle.","cons":"A kettle and tea\/coffee facilities in the room would have made it perfect.","average_score":3.20000004768372,"author":"Ashley"},{"pros":"location","cons":"nothing I can think off","average_score":3.20000004768372,"author":"Geraldine"},{"pros":"Friendly staff, clean room, location was good.","cons":"You could hear everything through the walls. Matintence work was going on and felt like it was happening in our room. When someone close by would close the hotel room door our whole room would shake.","average_score":2.79999995231628,"author":"Lisa"},{"pros":"Good location! ","cons":"Small rooms for 3 people. ","average_score":3.20000004768372,"author":"Marilena"},{"pros":"clean and comfort","cons":"Cleaners didn't speak English","average_score":2.79999995231628,"author":"Neil"},{"pros":"Service ","cons":"Clean ","average_score":3.59999990463257,"author":"Yiwei"},{"pros":"Good location in the city centre. Close to restaurants and shops. Staff was very friendly. The room with the canal view, which was nice add-on. Very comfy and clean room.","cons":"","average_score":3.59999990463257,"author":"Krzysztof"},{"pros":"the price and locations was balanced.","cons":"Everything else was ok, but the room was small and there were shelves and cabinets less for two-person. Also, the hair dryer was weak.","average_score":3.20000004768372,"author":"Ruth"},{"pros":"","cons":"No smoking area, poor breakfast ","average_score":3.20000004768372,"author":"Alexandra"},{"pros":"","cons":"Restaurant was closed and there was a shortage of a number of items on the snack menu. But otherwise fine.","average_score":3.59999990463257,"author":"Hani"},{"pros":"front desk staff was very friendly and helpful . front of the hotel clean and well maintained. ","cons":"dated rooms, musty smell in the bathroom (no fan), lots of knicks etc on the walls, tiny bathrooms","average_score":2.79999995231628,"author":"Echelle"},{"pros":"Brilliant staff, really nice and helping. Fast check-in and check-out.\nThe location is wonderful!\n\n","cons":"The bathroom is not too clean. A bit smelly, stains everywhere. No glass for toothbrush\/toothpaste, just a plastic cup. \nThe room is tiny.\nPretty bad value for money ratio I'd say","average_score":2.79999995231628,"author":"Nik"},{"pros":"I loved the staff, they were amable. Comfortable hotel. ","cons":"I didn’t like a lot the size of the room because was small for two people","average_score":3.59999990463257,"author":"Federica"},{"pros":"Great location and good overall ","cons":"The ambient perfume of cinnamon in the hotel is nice for a little but then tends to give sweets nausea. \nThe plastic toilet was not so great. I expected a normal toilet ","average_score":3.20000004768372,"author":"Tiziana"}]}